pratikdk/drivers_stm32f446re/Src/006_spi_txonly_arudino.c
/*
 * 006_spi_txonly_arudino.c
 *
 *  Created on: Sep 22, 2023
 *      Author: prati
 */


#include "stm32f446re_gpio_driver.h"
#include "stm32f446re_spi_driver.h"
#include "stm32f446re.h"
#include <string.h>

void delay(void)
{
	for (uint32_t i = 0; i < 500000/2; ++i);
}

void SPI2_GPIOInits(void)
{
	GPIO_Handle_t SPI_GPIOPins;

	SPI_GPIOPins.pGPIOx = GPIOB;
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5;
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPD_NO;
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// SCLK
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPI_GPIOPins);

	// MOSI
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPI_GPIOPins);

//	// MISO
//	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
//	GPIO_Init(&SPI_GPIOPins);

	// NSS
	SPI_GPIOPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&SPI_GPIOPins);
}

void SPI2_Inits(void)
{
	SPI_Handle_t SPI2Handle;

	SPI2Handle.pSPIx = SPI2;
	SPI2Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV8;
	SPI2Handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
	SPI2Handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
	SPI2Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
	SPI2Handle.SPIConfig.SPI_SSM = SPI_SSM_DI;

	SPI_Init(&SPI2Handle);
}

void GPIO_ButtonInit()
{
	GPIO_Handle_t GpioBtn;

	// blue button config
	GpioBtn.pGPIOx = GPIOC;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPD_NO;

	// Initialize GPIOC peripheral
	GPIO_Init(&GpioBtn);
}

int main(void)
{
	char user_data[] = "Hello slave, this is Pratik from stm32";

	GPIO_ButtonInit();

	SPI2_GPIOInits();

	SPI2_Inits(); // initialize()

	SPI_SSOEConfig(SPI2, ENABLE);

	while (1)
	{
		while (GPIO_ReadFromInputPin(GPIOC, GPIO_PIN_NO_13));

		delay();

		//SPI_SSIConfig(SPI2, ENABLE); // makes NSS signal high internally and avoids MODF error
		SPI_PeriControl(SPI2, ENABLE); // enable

		// send length info
		uint8_t dataLen = strlen(user_data);
		SPI_SendData(SPI2, &dataLen, 1);

		// send data
		SPI_SendData(SPI2, (uint8_t *) user_data, strlen(user_data));

		while (SPI_GetFlagStatus(SPI2, SPI_SR_BSY_FLAG_MASK));

		SPI_PeriControl(SPI2, DISABLE); // enable
	}

	return 0;
}
